const courses = [
  {
    id: "hYXnrJW6G",
    date: "2018-12-12T10:00:00.000Z",
    title: "Front-End розробка",
    anons:
      "Ми вчимо робити сайти: пояснюємо як працює браузер, як застосовувати на практиці HTML, CSS та JavaScript (ES6). Викладачі навчать повторювати роботу фреймворку, розкажуть про роботу інструменту для збирання додатків webpack",
  },
  {
    id: "TLN2nLcDIO",
    date: "2018-11-05T13:10:30.000Z",
    title: "Back-End розробка",
    anons:
      "Як створити масштабний сайт без використання готових систем? Як працюють інтернет-магазини та соцмережі? На ці питання відповідає наш курс з Back-End розробки.",
  },
  {
    id: "xxh4iOzra",
    date: "2019-01-10T12:03:50.000Z",
    title: "Advanced JavaScript",
    anons:
      "Якщо ти вже працюєш з JavaScript, настав час для React/Redux. Бібліотека React JS вирішує проблеми, пов'язані з інтерфейсом – товари у кошику, списки користувачів. Коли сторінок стає більше, в роботу входить Redux.",
  },
  {
    id: "jeOEQKc2k",
    date: "2019-01-22T15:50:30.000Z",
    title: "Python для початківців",
    anons:
      "Python — інтерпретована мова програмування. Програма пишеться як текст, ти її запускаєш і бачиш результат. Є бібліотеки, щоб створювати програми та ігри, синтаксис чіткий і зрозумілий.",
  },
  {
    id: "cDS766CpQK",
    date: "2019-02-12T10:50:20.000Z",
    title: "Advanced WordPress",
    anons:
      "На WordPress можна створювати сайти будь-якої складності. Платформа використовується для сайтів, новинних систем з аналітикою, сайтів з безліччю подій, продуктів, проектів, портфоліо, послуг компанії.",
  },
];

export default courses;
