/*  
Є загальний тип HttpCode

Завдання 
- функція handleErrorCase  має отримувати тільки "400" | "401" | "404" | "500"  
  Це має бути окремий тип    

- функція handleErrorCase  має отримувати тільки "200" | "201" | "204"
  Це має бути окремий тип  

- функція handleErrorCase  має отримувати всі типи   
            "200" | "201" | "204" | "400" | "401" | "404" | "500"     
  Це має бути комбінація попередніх типів 
*/

{
  type HttpCode = "400" | "401" | "404" | "500" | "200" | "201" | "204";

  // має отримувати тільки "400" | "401" | "404" | "500"
  const handleErrorCase = (code: string) => {};

  // має отримувати тільки "200" | "201" | "204"
  const handleSuccessCase = (code: string) => {};

  //  має отримувати тільки  "200" | "201" | "204" | "400" | "401" | "404" | "500"
  const handleAllCase = (code: HttpCode) => {};
}
